datomusic/duo-imxrt/src/lib/bs814a.cpp
#include "bs814a.h"

#include "Arduino.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"

#define BS814A_CLOCK_PERIOD_US 20
#define PIN_BS814A_CLOCK 3U
#define PIN_BS814A_DATA 2U

namespace BS814A {

void init() {
  pinMode(PIN_BS814A_CLOCK, OUTPUT);
  pinMode(PIN_BS814A_DATA, INPUT);
}

/*
  Bit 0:3 are Key 1 to Key 4 state. 0 is touched, 1 is no touch
  Bit 4:6 is a checksum. The number of keys touched
  Bit 7 is a stop bit. It is always 1

  The BS814A pulls the data pin low to signal that a touch is detected
*/

#define clock_low()                                                            \
  digitalWrite(PIN_BS814A_CLOCK, LOW);                                         \
  delayMicroseconds(BS814A_CLOCK_PERIOD_US);

#define clock_hi()                                                             \
  digitalWrite(PIN_BS814A_CLOCK, HIGH);                                        \
  delayMicroseconds(BS814A_CLOCK_PERIOD_US);

bool readRaw(TouchState &s) {
  if (digitalRead(PIN_BS814A_DATA) == 1) {
    return false;
  }

  int active_keys = 0;
  uint8_t *keys = (uint8_t *)(&s);

  for (int key = 0; key < KEY_COUNT; ++key) {
    clock_low();
    const bool active = !digitalRead(PIN_BS814A_DATA);
    keys[key] = active;

    if (active) {
      ++active_keys;
    }

    clock_hi();
  }

  uint8_t checksum_key_count = 0;
  uint8_t mask = 0x01;

  for (int i = 0; i < 3; ++i) {
    clock_low();
    if (digitalRead(PIN_BS814A_DATA)) {
      checksum_key_count |= mask;
    }

    clock_hi();
    mask <<= 1;
  }

  clock_low();
  // TODO: Do we need to read the stop bit?
  digitalRead(PIN_BS814A_DATA);
  clock_hi();

  return checksum_key_count == active_keys;
}
} // namespace BS814A
